Revit 2027 API
FormulaManager.GetFunctions Method
 Gets list of function names supported by formula engine
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<string> GetFunctions()
Public Shared Function GetFunctions As IList(Of String)
public:
static IList<String^>^ GetFunctions()
static member GetFunctions : unit -> IList<string>
Return Value
IList<String>
See Also
Reference
FormulaManager Class
Autodesk.Revit.DB Namespace